Revit 2024 API
DocumentValidation Class
 Utility functions with document validation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static class DocumentValidation
Visual Basic
Public NotInheritable Class DocumentValidation
Visual C++
public ref class DocumentValidation abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DocumentValidation
See Also
DocumentValidation Members
Autodesk.Revit.DB Namespace